export const NEWS_ITEMS = [
  {
    id: 1,
    data: "27 октября 2025",
    desc: "Газпромбанк объявил о запуске грантовой программы для вузов в 2026 году на 150 миллионов рублей",
    link: "#",
  },
  {
    id: 2,
    data: "23 октября 2025",
    desc: "Газпромбанк Премиум предоставляет лучшее предложение в сфере wellness  по данным Frank RG",
    link: "#",
  },
  {
    id: 3,
    data: "21 октября 2025",
    desc: "Газпромбанк представил лучшие решения для бизнеса на Петербургском международном газовом форуме –...",
    link: "#",
  },
];
