export const TASKS = [
  {
    title: "Задача 1 filter — вернуть часть элементов",
    desc: ` 🟢 📌 Есть массив чисел:\n
        [5, 8, 12, 3, 1]
        Верни только числа больше 5.`,
  },
  {
    title: "Задача 2 ",
    desc: `Есть массив объектов:`,
    taskCode: `
    [
        { name: 'Ann', age: 25 },
        { name: 'Bob', age: 17 },
        { name: 'John', age: 30 },
    ]
        `,
  },
  {
    title: "Задача 3 Умножь каждое число на 10.",
    desc: `Есть массив объектов:`,
    taskCode: `
    [
        [5, 8, 12, 3, 1];
    ]
        `,
  },
  {
    title: "Задача 4 Верни массив только имён.",
    desc: `Есть массив объектов:`,
    taskCode: `
    [
      { name: "Ann", age: 25 },
      { name: "Bob", age: 17 },
      { name: "John", age: 30 },
    ]
        `,
  },

  {
    title: "Задача 5 Найди элемент banana.",
    desc: `Есть массив объектов:`,
    taskCode: `
    ['apple', 'orange', 'banana']
        `,
  },
  {
    title: "Задача 6 Найди пользователя с id = 2.",
  },
  { title: "Задача 7 Проверь: есть ли число больше 5?" },
  { title: "Задача 8 Проверь: есть ли неактивный пользователь?" },
  { title: "Задача 9 Проверь: все ли числа больше 5?" },
  { title: "Задача 10 Проверь: все ли значения true?" },
  {
    title: "Задача 11 Найди сумму всех элементов",
    taskCode: "[5, 8, 12, 3, 1]",
  },
  {
    title: "Задача 12 Найди общий возраст активных пользователей",
    taskCode: `  { id: 1, name: "Ann", age: 25, isActive: true },
  { id: 10, name: "Bob", age: 17, isActive: true },
  { id: 2, name: "John", age: 30, isActive: false },`,
  },
  { title: "Задача 13 Удали 1 элемент, выведи удаленый элемент и массив" },
  {
    title:
      "Задача 14 Удали последний элемент, выведи удаленый элемент и массив",
  },
  {
    title: "Задача 15 (splice вставка) (splice удаление) (splice замена)",
  },
];

export const TASKS_2 = [];

export const NAME_AGE = [
  { id: 1, name: "Ann", age: 25, isActive: true },
  { id: 10, name: "Bob", age: 17, isActive: true },
  { id: 2, name: "John", age: 30, isActive: false },
];

export const TEST_NUMBER_ARRAY = [5, 8, 12, 3, 1];
